download data and unzip
`kaggle competitions download -c titanic`

In [1]:
import pandas as pd

In [3]:
train_data = pd.read_csv("./dataset/train.csv")
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
test_data = pd.read_csv("./dataset/test.csv")
test_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [6]:
# 看标签列分布情况
train_data['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

根据分布情况，决定使用什么样的cross-validation， k-fold k取多大。使用什么metric来当衡量指标。
数据量并不多，分布没有非常的偏斜。
kfold? AUC?

In [10]:
# 看每一列分布情况
def first_look_data(train_data):
    for col in train_data.columns:
        print(f"Number of distinct elements for column '{col}': {train_data[col].nunique()}")
        print(f"Distinct values and their count for column '{col}':")
        print(train_data[col].value_counts())
        print("==="*20)

first_look_data(train_data)

Number of distinct elements for column 'PassengerId': 891
Distinct values and their count for column 'PassengerId':
1      1
599    1
588    1
589    1
590    1
      ..
301    1
302    1
303    1
304    1
891    1
Name: PassengerId, Length: 891, dtype: int64
============================================================
Number of distinct elements for column 'Survived': 2
Distinct values and their count for column 'Survived':
0    549
1    342
Name: Survived, dtype: int64
============================================================
Number of distinct elements for column 'Pclass': 3
Distinct values and their count for column 'Pclass':
3    491
1    216
2    184
Name: Pclass, dtype: int64
============================================================
Number of distinct elements for column 'Name': 891
Distinct values and their count for column 'Name':
Braund, Mr. Owen Harris                     1
Boulos, Mr. Hanna                           1
Frolicher-Stehli, Mr. Maxmillian            1
Gilinski, Mr. Eliezer                       1
Murdlin, Mr. Joseph                         1
                                           ..
Kelly, Miss. Anna Katherine "Annie Kate"    1
McCoy, Mr. Bernard                          1
Johnson, Mr. William Cahoone Jr             1
Keane, Miss. Nora A                         1
Dooley, Mr. Patrick                         1
Name: Name, Length: 891, dtype: int64
============================================================
Number of distinct elements for column 'Sex': 2
Distinct values and their count for column 'Sex':
male      577
female    314
Name: Sex, dtype: int64
============================================================
Number of distinct elements for column 'Age': 88
Distinct values and their count for column 'Age':
24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: Age, Length: 88, dtype: int64
============================================================
Number of distinct elements for column 'SibSp': 7
Distinct values and their count for column 'SibSp':
0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64
============================================================
Number of distinct elements for column 'Parch': 7
Distinct values and their count for column 'Parch':
0    678
1    118
2     80
5      5
3      5
4      4
6      1
Name: Parch, dtype: int64
============================================================
Number of distinct elements for column 'Ticket': 681
Distinct values and their count for column 'Ticket':
347082      7
CA. 2343    7
1601        7
3101295     6
CA 2144     6
           ..
9234        1
19988       1
2693        1
PC 17612    1
370376      1
Name: Ticket, Length: 681, dtype: int64
============================================================
Number of distinct elements for column 'Fare': 248
Distinct values and their count for column 'Fare':
8.0500     43
13.0000    42
7.8958     38
7.7500     34
26.0000    31
           ..
35.0000     1
28.5000     1
6.2375      1
14.0000     1
10.5167     1
Name: Fare, Length: 248, dtype: int64
============================================================
Number of distinct elements for column 'Cabin': 147
Distinct values and their count for column 'Cabin':
B96 B98        4
G6             4
C23 C25 C27    4
C22 C26        3
F33            3
              ..
E34            1
C7             1
C54            1
E36            1
C148           1
Name: Cabin, Length: 147, dtype: int64
============================================================
Number of distinct elements for column 'Embarked': 3
Distinct values and their count for column 'Embarked':
S    644
C    168
Q     77
Name: Embarked, dtype: int64
============================================================